In [1]:
import numpy as np
import pandas as pd

In [24]:
dataset = {
    "Department": ["IT","HR","PRODUCTION","PRODUCTION","IT","HR"],
    "Worker":["Eljan","Nurlan","Serdar","Ruhin","Shahmar","Ibahim"],
    "Salary":[3000,3500,2500,4500,4000,2000]
}

In [25]:
df = pd.DataFrame(dataset)

In [26]:
df

   Department   Worker  Salary
0          IT    Eljan    3000
1          HR   Nurlan    3500
2  PRODUCTION   Serdar    2500
3  PRODUCTION    Ruhin    4500
4          IT  Shahmar    4000
5          HR   Ibahim    2000

In [29]:
DepGroup = df.groupby("Department")

In [32]:
DepGroup.sum()

            Salary
Department
HR            5500
IT            7000
PRODUCTION    7000

In [34]:
df.groupby("Department").sum()

            Salary
Department
HR            5500
IT            7000
PRODUCTION    7000

In [36]:
int(df.groupby("Department").sum().loc["HR"])

5500

In [38]:
df.groupby("Department").count()

            Worker  Salary
Department
HR               2       2
IT               2       2
PRODUCTION       2       2

In [39]:
df.groupby("Department").max()

             Worker  Salary
Department
HR           Nurlan    3500
IT          Shahmar    4000
PRODUCTION   Serdar    4500

In [40]:
df.groupby("Department").min()

            Worker  Salary
Department
HR          Ibahim    2000
IT           Eljan    3000
PRODUCTION   Ruhin    2500

In [47]:
df.groupby("Department").min()["Salary"]["IT"]

3000

In [48]:
df.groupby("Department").mean()

            Salary
Department
HR            2750
IT            3500
PRODUCTION    3500

In [49]:
df.groupby("Department").mean()["Salary"]["IT"]

3500